In [5]:
# importar pandas
from pandas import Series, DataFrame
import pandas as pd

obj = Series([4,7,-5,3])
obj.values
obj.index

obj2 = Series(data=[4,7,-5,3], index=['d', 'b', 'a', 'c'])
obj2.values
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [6]:
obj2['a']

-5

In [7]:
obj2['d'] = 6
obj2.values

array([ 6,  7, -5,  3], dtype=int64)

In [8]:
obj2[['c', 'a', 'd']]
obj2

c    3
a   -5
d    6
dtype: int64

In [15]:
obj2 [obj2  > 0]
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [22]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

obj3 = Series(sdata)

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
#Juntando valores em duas listas
states = ['california', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

california        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj4)

california     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [ ]:
obj.index

In [32]:
#convertendo dicionario para dataFrame
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop':  [1.5,1.7,3.6,2.4,2.9]
        }
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [33]:
#Adicionando coluna e renomeando indices
frame2 = DataFrame(data,
                    columns=['year', 'state', 'pop', 'debt'],
                    index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [35]:
#Ler uma coluna
frame2.state

frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [41]:
#Ler uma linha
frame.iloc[1]

frame2.loc['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [43]:
#preencher coluna de valores nulos
import numpy as np
frame2['debt'] = np.arange(5)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [44]:
frame2['debt'] = frame2['pop'] *.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  0.75
two    2001    Ohio  1.7  0.85
three  2002    Ohio  3.6  1.80
four   2001  Nevada  2.4  1.20
five   2002  Nevada  2.9  1.45

In [45]:
#Atribuir valor aos indices
val = Series(data=[-1.2, -1.5, -1.7],
             index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [48]:
#Criar coluna para validação
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [49]:
#Deletar coluna
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [50]:
#Dicionario aninhado
pop = {'Nevada':{2001: 2.4, 2002:2.9},
       'Ohio':{2000: 1.5, 2001:1.7, 2002:3.6}}
frame3 = DataFrame(pop)
frame3.

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5